espressif/esp-eth-drivers/common_examples/simple-ethernet/sdkconfig.defaults.ip101_esp32p4
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ETHERNET_INTERNAL_SUPPORT=y

CONFIG_ETHERNET_PHY_IP101=y
CONFIG_ETHERNET_PHY_RTL8201=n
CONFIG_ETHERNET_PHY_LAN87XX=n
CONFIG_ETHERNET_PHY_DP83848=n
CONFIG_ETHERNET_PHY_KSZ80XX=n
CONFIG_ETHERNET_PHY_LAN867X=n

CONFIG_ETHERNET_SPI_SUPPORT=n